name: "encoder_text"
platform: "onnxruntime_onnx"
max_batch_size: 128
input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [-1]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [-1]
  }
]
output [
  {
    name: "text_features"
    data_type: TYPE_FP32
    dims: [-1]
  }
]
dynamic_batching {
  preferred_batch_size: [4, 8, 16, 32, 64, 128]
}